In [1]:
# 서울특별시 강남구 삼성로 212

In [2]:
import pandas as pd
import numpy as np

In [5]:
s = pd.Series(np.random.randn(10),
                     index = [['a', 'a', 'a' ,'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                                     [1, 2, 3, 1 ,2 , 3, 1, 2 ,2, 3]])

In [6]:
s

a  1    0.310178
   2   -0.004241
   3   -1.030086
b  1    1.247302
   2   -1.006319
   3   -0.703130
c  1   -1.395204
   2   -0.164618
d  2   -0.239677
   3    1.476501
dtype: float64

In [7]:
s.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [8]:
s['a']

1    0.310178
2   -0.004241
3   -1.030086
dtype: float64

In [9]:
s['a'][1]

0.3101776840832008

In [11]:
s['b':'c']

b  1    1.247302
   2   -1.006319
   3   -0.703130
c  1   -1.395204
   2   -0.164618
dtype: float64

In [12]:
s[('b', 3)]

-0.7031300703375101

In [13]:
s[:, 2]

a   -0.004241
b   -1.006319
c   -0.164618
d   -0.239677
dtype: float64

In [15]:
df = pd.DataFrame(np.arange(12).reshape((4, 3)),
                                             index = [['a', 'a' ,'b' ,'b'],
                                                        [1, 2, 1, 2]],
                                 columns = [['Seoul', 'Seoul', 'Busan'],
                                                   ['Green', 'Red', 'Green']])

In [16]:
df

    Seoul     Busan
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [17]:
df.index.names = ['key1', 'key2']

In [18]:
df

          Seoul     Busan
          Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [19]:
df.columns.names = ['city', 'color']

In [20]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [21]:
df["Seoul"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [22]:
df[("Seoul", "Green")]

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: (Seoul, Green), dtype: int32

In [23]:
df.loc['a']

city  Seoul     Busan
color Green Red Green
key2
1         0   1     2
2         3   4     5

In [25]:
df.loc[('a', 1)]

city   color
Seoul  Green    0
       Red      1
Busan  Green    2
Name: (a, 1), dtype: int32

In [26]:
df.loc['b', ("Seoul", "Red")]

key2
1     7
2    10
Name: (Seoul, Red), dtype: int32

In [27]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [28]:
df.loc[("b", 2), "Busan"]

color
Green    11
Name: (b, 2), dtype: int32

In [29]:
df.loc[("b", 1), ("Seoul", "Green")]

6

In [30]:
df.sort_index(axis = 0, level = 0)

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [31]:
df.sort_index(axis=0, level=1)

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [32]:
df.sort_index(axis=0, level='key2')

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [33]:
df.sort_index(axis=1, level=0)

city      Busan Seoul
color     Green Green Red
key1 key2
a    1        2     0   1
     2        5     3   4
b    1        8     6   7
     2       11     9  10

In [34]:
df.sort_index(axis=1, level=1)

city      Busan Seoul
color     Green Green Red
key1 key2
a    1        2     0   1
     2        5     3   4
b    1        8     6   7
     2       11     9  10

In [35]:
df.sort_values(by=("Busan", "Green"))

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [36]:
df.sum(axis=0, level=0)

city  Seoul     Busan
color Green Red Green
key1
a         3   5     7
b        15  17    19

In [37]:
df.sum(axis=0, level=1)

city  Seoul     Busan
color Green Red Green
key2
1         6   8    10
2        12  14    16

In [38]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [39]:
df.mean(axis=1, level="color")

color      Green  Red
key1 key2
a    1         1    1
     2         4    4
b    1         7    7
     2        10   10

In [40]:
# 계층적 인덱스로 변환하기

df2 = pd.DataFrame({'a': range(7), 'b': range(7,0,-1),
                       'c':['one','one','one','two', 'two','two','two'],
                       'd':[0, 1, 2, 0, 1, 2, 3]})

In [41]:
df2

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [45]:
df3 = df2.set_index(["c", "d"])

In [46]:
df3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [43]:
df2.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [47]:
df3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [48]:
df3.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [49]:
df4 = pd.DataFrame(np.arange(6).reshape((2, 3)),
                                index = ['Seoul', 'Busan'],
                              columns = ['one', 'two', 'three'])
df4.index.name = 'cuty'
df4.columns.name = 'number'

In [50]:
df4

number  one  two  three
cuty
Seoul     0    1      2
Busan     3    4      5

In [53]:
df5 = df4.stack()

df5

In [54]:
df5

cuty   number
Seoul  one       0
       two       1
       three     2
Busan  one       3
       two       4
       three     5
dtype: int32

In [55]:
df5.unstack()

number  one  two  three
cuty
Seoul     0    1      2
Busan     3    4      5

In [56]:
df5.unstack(level=0)

cuty    Seoul  Busan
number
one         0      3
two         1      4
three       2      5

In [57]:
df5.unstack(level="cuty")

cuty    Seoul  Busan
number
one         0      3
two         1      4
three       2      5

In [58]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index = ['c', 'd', 'e'])
s3 = pd.concat([s1, s2], keys=['one', 'two'])

In [59]:
s3

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [60]:
s3.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [61]:
df6 = pd.DataFrame({'left': df5, 'right':df5+5},
                              columns = ['left', 'right'])
df6.columns.name = 'side'

In [62]:
df6

side          left  right
cuty  number
Seoul one        0      5
      two        1      6
      three      2      7
Busan one        3      8
      two        4      9
      three      5     10

In [63]:
# unstack() -> 최하위에서 최하위로!
df6.unstack()

side   left           right
number  one two three   one two three
cuty
Seoul     0   1     2     5   6     7
Busan     3   4     5     8   9    10

In [64]:
df6.unstack(level='cuty')

side    left       right
cuty   Seoul Busan Seoul Busan
number
one        0     3     5     8
two        1     4     6     9
three      2     5     7    10

In [65]:
df6.unstack(level='cuty').stack(level='side')

cuty          Busan  Seoul
number side
one    left       3      0
       right      8      5
two    left       4      1
       right      9      6
three  left       5      2
       right     10      7